app/controllers/books_controller.rb

INSERT INTO "books" ("title", "description", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "123456u"], ["description", "2wqsdfgh"], ["author", "iam"], ["user_id", 2], ["created_at", "2019-01-14 17:07:14.349718"], ["updated_at", "2019-01-14 17:07:14.349718"]]
---
  def create
    if current_user.admin?
      @book = current_user.books.build(book_params)

      respond_to do |format|
        if @book.save

UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "Test test"], ["updated_at", "2018-12-27 02:21:32.833809"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 5]]
---
  def destroy
    @book.destroy

INSERT INTO "libraries" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["user_id", 3], ["created_at", "2019-01-15 06:25:56.092283"], ["updated_at", "2019-01-15 06:25:56.092283"]]
DELETE FROM "libraries" WHERE "libraries"."user_id" = ? AND "libraries"."book_id" = ?  [["user_id", 3], ["book_id", 6]]
---
  def library
    type = params[:type]

    if type == "add"
      current_user.library_additions << @book
      redirect_to library_index_path, notice: "#{@book.title} was added to your library"

    elsif type == "remove"
      current_user.library_additions.delete(@book)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])